{
  "speakers": [
    {
      "id": "ee5aae31bd834d5aa9264f3dece7acdc",
      "firstName": "Ben",
      "lastName": "Hoelting",
      "fullName": "Ben Hoelting",
      "company": "Aspenware",
      "blog": "http://www.benhblog.com/",
      "twitter": "http://twitter.com/@benhnet",
      "bio": "<p>Ben is a software guy with &ldquo;people skills&rdquo;. He loves software and technology but also enjoys sports, movies and spending time with his wife and three children. In truth, he&rsquo;s just a big kid. He loves designing systems that solve real world problems. There is nothing more satisfying than seeing something you helped develop being used by the end users. Ben joined the IT industry in 1996 as an intern and has worked with .NET since its inception back in 2001.&nbsp; This has given him the experience of a senior level full stack .NET developer.&nbsp; He is an experienced speaker and presents at the Visual Studio Live conferences all around the country. He loves sharing his experiences with developing software.&nbsp; Ben is a Microsoft MVP in Visual Studio Development Technologies and a Microsoft Certified Technology Specialist (MCTS) for Web and Windows .NET 4.0. His blog is at http://www.benhblog.com and his twitter stream is at http://twitter.com/benhnet.&nbsp; Finally, Ben is very involved in the local .NET community and is the leader of the South Colorado .NET User Group.</p>",
      "imgUrl": "https://az118040.vo.msecnd.net/assets/45d9639859ed40a0a2978ac90becde71/speaker/ed7fd83dbc0a49e18a4b9a5525bed77b/Hoelting-C.jpg"
    },
    {
      "id": "44a69af8b518474ea91f55fae4026e3f",
      "firstName": "Chris",
      "lastName": "Fornof",
      "fullName": "Chris Fornof",
      "company": "",
      "blog": "",
      "twitter": "",
      "bio": "<p>Chris is a strategist who analyzes long-term implications of projects of social value. Research has spanned fields from biofuels to manufacturing and VR.</p>",
      "imgUrl": "https://media.licdn.com/media/AAEAAQAAAAAAAAXMAAAAJDNjYzY0NThjLTQzYjEtNDU2Yi04OTQ0LTUwZjRiMTk4MjFlOA.jpg"
    },
    {
      "id": "1c43c2ce21154271a576c2a9be70c9b1",
      "firstName": "Daren",
      "lastName": "May",
      "fullName": "Daren May",
      "company": "",
      "blog": "https://www.linkedin.com/in/darenmay",
      "twitter": "http://twitter.com/@darenmay",
      "bio": "<p>Daren May is the President and co-founder of Crank211 &mdash; a company that specializes in designing and building next-level digital experiences. Daren has written and presented a number of MVAs and spoken at Microsoft Ignite. He has leveraged Microsoft technologies since the beta versions of Visual Studio .NET and has been developing XAML-based solutions since the heady days of &ldquo;Avalon&rdquo; (the early name for WPF).</p>",
      "imgUrl": "https://az118040.vo.msecnd.net/assets/45d9639859ed40a0a2978ac90becde71/speaker/8b677cc42fbc4fd784a36673bddfbddb/Daren%20May.jpg"
    },
    {
      "id": "eccc7f3ede15424cbdf89877abe98286",
      "firstName": "Dave",
      "lastName": "Rael",
      "fullName": "Dave Rael",
      "company": "Raelyard Soutions",
      "blog": "http://developeronfire.com/",
      "twitter": "http://twitter.com/@raelyard",
      "bio": "<p>Dave Rael is a dad, husband, podcaster, and seasoned software developer and architect. &nbsp;He is the host of the <a href=\"http://developeronfire.com\">Developer On Fire</a> podcast, where he gets amazing programmers to tell awesome and inspiring stories. &nbsp;When he's not building distributed systems or playing with his children, he likes to read and play basketball, racquetball, and lift weights.</p>",
      "imgUrl": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/7/005/0aa/2c3/08af3ca.jpg"
    },
    {
      "id": "153df63b4b624959b490c1bde2530451",
      "firstName": "David ",
      "lastName": "Yack",
      "fullName": "David  Yack",
      "company": "",
      "blog": "http://davidyack.me/",
      "twitter": "http://twitter.com/@DavidYack",
      "bio": "<p>David is the CTO of Colorado Technology Consultants based in Colorado. He is a Microsoft Regional Director and a Microsoft MVP. As a senior hands&rsquo; on technology and business consultant with over 20 years of industry experience, David enjoys developing applications on the Microsoft platforms, specializing in large system architecture and design. David focus is on helping clients migrate and build new applications on Microsoft technologies, as well as helping to mentor and train their staffs.</p>",
      "imgUrl": "http://extremecrm.com/DesktopModules/ExtremeCRM/Speaker/images/david-yack-v1.jpg"
    },
    {
      "id": "26e95e4037dc4161b3739fa3df2ce415",
      "firstName": "Donald ",
      "lastName": "Lutz",
      "fullName": "Donald  Lutz",
      "company": "",
      "blog": "",
      "twitter": "",
      "bio": "<p>He is the CTO of Technetronic Solutions, a Microsoft partner. He focuses in on building secure microservices using ASP.NET Core, Docker, and Azure.</p>",
      "imgUrl": "https://az118040.vo.msecnd.net/assets/45d9639859ed40a0a2978ac90becde71/speaker/af962f4b149648459ca54ce34e1eaf22/DonaldLutz.jpg"
    },
    {
      "id": "1d4bd1f622114bbcb29997ef1dd5ff24",
      "firstName": "Doris",
      "lastName": "Chen",
      "fullName": "Doris Chen",
      "company": "Microsoft",
      "blog": "",
      "twitter": "",
      "bio": "<p>Dr. Doris Chen is a Senior Technology Evangelist at Microsoft for the Western region of the United States, specialized in web technologies (mobile web, HTML5, JavaScript, and Java). <br />Doris has worked on many open source web tier technologies, Java platform, .NET and distributed computing technologies. She speaks at numerous international conferences and user groups including O&rsquo;Reilly OSCON, Fluent, Dev Nexus, HTML5 Dev Conference, WebVisions, JavaOne, SD Forum, and worldwide User Groups. Doris works very closely to create and foster the open source community around Java, NetBeans, Glassfish, and related technologies. Before joining Microsoft, Doris Chen was a Technology Evangelist at Sun Microsystems.<br />Doris received her Ph.D. from the University of California at Los Angeles (UCLA) in computer engineering, specializing in medical informatics.</p>",
      "imgUrl": "https://pbs.twimg.com/profile_images/1019238142/Doris_pro.jpg"
    },
    {
      "id": "3394be1d1b724e7babaa6f780a17eaa3",
      "firstName": "Geoffrey ",
      "lastName": "Callaghan",
      "fullName": "Geoffrey  Callaghan",
      "company": "",
      "blog": "",
      "twitter": "",
      "bio": "<p>I have close to twenty years of experience in software development. I have worked on projects that run the gamut from debugging legacy code on integrated circuits in industrial applications to creating modern software using WPF, WCF, MVC and MVVM. Having worked as a manager, a technical lead, and a business analyst, I am familiar with all stages of the software development process, and am as comfortable in front of customers as I am behind a keyboard.</p>\r\n<p>My goal in developing software is not just to meet deadlines and complete tasks, but to ensure that the resulting application meets the needs of the customer.</p>",
      "imgUrl": "http://www.codemag.com/DynamicImage/Person/921ee5d8-695c-4712-a89e-4b7a6713ce57"
    },
    {
      "id": "e78845add78747bba960e41d424f03c7",
      "firstName": "George",
      "lastName": " Young",
      "fullName": "George  Young",
      "company": "",
      "blog": "",
      "twitter": "",
      "bio": "<p>George has worked as a software developer for the past two decades, including twelve at Microsoft. He is currently an independent consultant (Dawson Butte Software) living at 7000 feet in Larkspur, Colorado, where he works primarily on .NET applications.</p>",
      "imgUrl": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/2/000/188/3d5/30bb039.jpg"
    },
    {
      "id": "97b6a4eb6af64fcd8c6b7d08b84ba475",
      "firstName": "Grigoriy ",
      "lastName": "Belenkiy",
      "fullName": "Grigoriy  Belenkiy",
      "company": "S&P Global",
      "blog": "https://www.linkedin.com/in/grishace",
      "twitter": "http://twitter.com/@grishace",
      "bio": "<p>Software engineer at <a href=\"https://www.spglobal.com\">S&amp;P Global</a> (NYSE: SPGI) with 20 years of experience in software craftsmanship from Perl web-applications in 90's through classic ASP into C#/ASP.NET in early 2000, and C# desktop applications in 05's. Now polyglot developer using C#/Java/Scala and F#. Active member of the Denver Visual Studio User Group from 2007.</p>",
      "imgUrl": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/1/005/02e/336/3a08753.jpg"
    },
    {
      "id": "cf70d98c001d4deaaea4c0af61eba261",
      "firstName": "James ",
      "lastName": "Sturtevant",
      "fullName": "James  Sturtevant",
      "company": "",
      "blog": "",
      "twitter": "http://twitter.com/@aspenwilder",
      "bio": "<p>James (@aspenwilder) works for Microsoft where he partners developers to explore the latest technologies. Prior to Microsoft, he worked in the web development space for 10+ years working with startups and enterprises to improve the way they do business through technology. Recently he has been taking an interest in mobile development as a way to deliver unique experiences. &nbsp;When he isn&rsquo;t practicing his software craft James can be found running through the woods, climbing mountains, or hiking with his daughters.</p>",
      "imgUrl": "http://www.jamessturtevant.com/assets/profile-high-res.jpg"
    },
    {
      "id": "5c55bdbac40c4223b2c020313cdd081b",
      "firstName": "Jerry",
      "lastName": "Nixon",
      "fullName": "Jerry Nixon",
      "company": "Microsoft",
      "blog": "http://jerrynixon.com/",
      "twitter": "http://twitter.com/http://twitter.com/jerrynixon",
      "bio": "<p>A Developer Evangelist for Microsoft from Colorado, Jerry teaches and speaks on Windows, Phone, and Desktop development. His career launched with Microsoft SQL Server 6.5, delivering data-centric solutions while &ldquo;database developer&rdquo; was a novel term. He received a civilian Naval Commendation for security work, preceding his work for the startup that would become Microsoft CRM. For two decades, Jerry built Microsoft-centric, mobile solutions. Today, he speaks on XAML, UWP, mobility and Kinect at events, communities, universities, and online. The bulk of Jerry&rsquo;s free time is spent teaching his three daughters Star Trek character backstories and episode plots.</p>",
      "imgUrl": "https://how6fq.bn1302.livefilestore.com/y3mU2GOq5qQAonUpHZqxMS7IDD1VlY5wvamWnq3BjwpPG3BGYMrV2Jt8YRp_U0EC9x775ZSWEfpf32YcKgdjlym7wLRAgQyGS2p65oVKZyrILA2yRvoqb-8EOrww0obbJcI06tNto9_hiY8hHo8NdSzXzbjiJv5edQ-y1E2CdZ2-us/jnixon_microsoft_com_LThumb.jpg?psid=1"
    },
    {
      "id": "281bc0aede4d4477b0fd7f467fac45ed",
      "firstName": "Joe ",
      "lastName": "Mayo",
      "fullName": "Joe  Mayo",
      "company": "",
      "blog": "",
      "twitter": "http://twitter.com/@JoeMayo",
      "bio": "<p>Joe Mayo is an author and independent software consultant, specializing in Microsoft technologies. Joe has written 7 books, many magazine articles, and taught numerous on-line and in-person courses. His experience spans multiple technologies for desktop, cloud, and device. He is also author of the LINQ to Twitter open source project. Joe is a long-time MVP with several years of awards. Joe tweets (as @JoeMayo) about chatbots on Twitter.</p>",
      "imgUrl": "https://media.licdn.com/media/p/1/000/026/35d/26f8e2e.jpg"
    },
    {
      "id": "51d198ad5a3e488bb77abee724854257",
      "firstName": "Laurie ",
      "lastName": "Atkinson",
      "fullName": "Laurie  Atkinson",
      "company": "",
      "blog": "https://blogs.msdn.microsoft.com/laurieatkinson/",
      "twitter": "",
      "bio": "<p>Laurie Atkinson is a senior consultant with Microsoft in the Premier Developer Practice where she conducts workshops and assists teams with .NET architecture, web development, and best practices. Most recently she has been helping customers build solutions using HTML5, AngularJS, and ASP.NET MVC. She holds a master&rsquo;s degree in Computer Science from the University of Colorado and has been developing on the Microsoft platform since the 1990s.</p>",
      "imgUrl": "https://i1.social.s-msft.com/profile/u/avatar.jpg?displayname=laurie%20atkinson&size=extralarge&version=d7e8c5d4-c60c-4c4d-a881-c6d4deae26c3"
    },
    {
      "id": "afd2610e0b6841a089e0e3a516a3b265",
      "firstName": "Martin ",
      "lastName": "Buchanan",
      "fullName": "Martin  Buchanan",
      "company": "",
      "blog": "",
      "twitter": "",
      "bio": "<p>Martin is a writer and software engineer with 40 years of experience including 5 years of embedded systems development, 15 years of enterprise Windows systems development, and 15 years of documenting operating systems and processors.</p>",
      "imgUrl": "http://bgtask.com/MlbWwSdPic.jpg"
    },
    {
      "id": "d1ce2d4b16ad458b8afefd470ac40c1f",
      "firstName": "Nathan ",
      "lastName": "Renner",
      "fullName": "Nathan  Renner",
      "company": "",
      "blog": "",
      "twitter": "",
      "bio": "<p>Nathan is a software architect for RevGen Partners and has been a developer for over 15 years. Many of those years have been spent designing and building enterprise applications across a variety of industries. Nathan has a passion for engaging with software engineers throughout Colorado and regularly runs a local workshop for both RevGen and client developers. He&rsquo;s always on the lookout for opportunities to share his passion for technology.</p>",
      "imgUrl": "https://skyfire.blob.core.windows.net/images/profile-1-lg.jpg"
    },
    {
      "id": "fa86041399a74f9eaae6c8af2699c674",
      "firstName": "Parker ",
      "lastName": "Smart",
      "fullName": "Parker  Smart",
      "company": "",
      "blog": "",
      "twitter": "",
      "bio": "<p>I've been writing code since the Apple ][. &nbsp;Do the math, it's a LONG time.</p>",
      "imgUrl": "http://spilledmilk.com/images/parkerheadshot.jpg"
    },
    {
      "id": "d2823eed5bd240b086c75b74bd4407f0",
      "firstName": "Paul ",
      "lastName": "Nielsen",
      "fullName": "Paul  Nielsen",
      "company": "",
      "blog": "https://www.linkedin.com/pub/paul-nielsen/1/b00/a37",
      "twitter": "",
      "bio": "<p>Paul is the author of SQL Server 2008 Bible, a SQL Server MVP (2004 - 2016), and technical founder of Tejon Tech - offering an SQL/NoSQL Object/Relational Graph database.</p>",
      "imgUrl": "http://www.tejontech.com/uploads/1/5/9/3/15932194/___3766000.jpg"
    },
    {
      "id": "713c454f81c34cd4b2b487c2f2254ade",
      "firstName": "Rob",
      "lastName": "Koch",
      "fullName": "Rob Koch",
      "company": "S&P Global",
      "blog": "http://www.benhblog.com/",
      "twitter": "",
      "bio": "<p>Rob Koch has been developing in a variety of languages starting with Pascal and MS Access. These days he now delves in C#, T-SQL, Python, and javascript. He works at <a href=\"https://www.spglobal.com\">S&amp;P Global</a> as a developer/data scientist.</p>",
      "imgUrl": "https://media.licdn.com/media/p/7/000/1ec/040/2fe0372.jpg"
    },
    {
      "id": "5cffcf3634bb471e8d47f5eaf8d37040",
      "firstName": "Shawn ",
      "lastName": "Kendrot",
      "fullName": "Shawn  Kendrot",
      "company": "",
      "blog": "http://visuallylocated.com/",
      "twitter": "http://twitter.com/skendrot",
      "bio": "<p>Shawn Kendrot is a father of two amazing kids. He is a Microsoft MVP in Windows Development and loves XAML. Shawn has been working with XAML since WPF was released and hasn't looked back since. You can follow Shawn on twitter at @skendrot and read his blog at VisuallyLocated.com</p>",
      "imgUrl": "https://az118040.vo.msecnd.net/assets/45d9639859ed40a0a2978ac90becde71/speaker/624d4ab8a430446383c2a39b5f6e04b3/Shawn%20Kendrot.png"
    },
    {
      "id": "1439a44d72c849eeac40da661084c607",
      "firstName": "Travis ",
      "lastName": "Haley",
      "fullName": "Travis  Haley",
      "company": "",
      "blog": "",
      "twitter": "",
      "bio": "<p>Travis is a technology enthusiast and day to day application developer.</p>",
      "imgUrl": "https://media.licdn.com/mpr/mpr/shrinknp_200_200/p/2/000/0f1/16c/3ba3eec.jpg"
    },
    {
      "id": "de1a0dced6ee43549c13e27c7076f026",
      "firstName": "Will ",
      "lastName": "Robertson",
      "fullName": "Will  Robertson",
      "company": "",
      "blog": "",
      "twitter": "",
      "bio": "<p>Will is a Software Architect at Intel, developing software for the large scale manufacturing of world-class semiconductor products. Specializing in software and parallel architecture, Will works mostly in the .NET space but also works with a number of other technologies. Prior to joining Intel, Will worked for Infragistics as a Principal Architect creating solutions for small through to Fortune 100 companies across a number of industries.</p>",
      "imgUrl": "https://media.licdn.com/media/p/6/000/1cc/23e/14a1b28.jpg"
    }
  ],
  "sessions": [
    {
      "id": "ed6932be3bc64c4389be62baa130b191",
      "title": "Power BI for the Developer: Embedding BI Visuals in Your Apps",
      "speakers": [
        {
          "id": "e78845add78747bba960e41d424f03c7",
          "fullName": "George  Young"
        }
      ],
      "abstract": "<p>Microsoft's Power BI continues to add new features and functionality. &nbsp;Developers may now incorporate rich, interactive Power BI visuals in their applications with very little effort. &nbsp;In this session, we'll do a quick tour of Power BI, create an interactive graphic Report, and then look at two ways of embedding this in a web app.</p>",
      "time": "2016-10-28T15:00:00Z",
      "room": "Room 4 (Pyramid Peak)",
      "roomId": "7e4b17cd6758411ca826f3fc15207c84"
    },
    {
      "id": "3fae7046ae7c41f6aefbdc52dcd8089d",
      "title": "An Introduction to ASP.NET Core",
      "speakers": [
        {
          "id": "d1ce2d4b16ad458b8afefd470ac40c1f",
          "fullName": "Nathan  Renner"
        }
      ],
      "abstract": "<p>ASP.NET Core has officially been released. What does that mean for MVC developers? This session will focus on the features of ASP.NET Core that directly impact web developers. Key characteristics of the platform will be explored through scenario driven examples.</p>",
      "time": "2016-10-28T15:00:00Z",
      "room": "Room 1 & 2 (Maroon Bells 1 & 2)",
      "roomId": "628f7d2ad64841d88d8f4f33daf9d3b7"
    },
    {
      "id": "0328aae32af4433599cc44e23a9d7788",
      "title": "Lightning Talks 1 - Azure, DB, WPF",
      "speakers": [
        {
          "id": "1439a44d72c849eeac40da661084c607",
          "fullName": "Travis  Haley"
        },
        {
          "id": "d2823eed5bd240b086c75b74bd4407f0",
          "fullName": "Paul  Nielsen"
        },
        {
          "id": "3394be1d1b724e7babaa6f780a17eaa3",
          "fullName": "Geoffrey  Callaghan"
        }
      ],
      "abstract": "<p>- Take Your Services to the Cloud - Azure Service Bus, Travis Haley&nbsp;</p>\r\n<p>A quick talk on how to publish windows services to the Azure cloud and connect to them locally.</p>\r\n<p><br />- Viewing Data Nodes and Connections with SQL Server and TejonDB, Paul Nielsen</p>\r\n<p>Since the 60's databases have been rows and columns unless you're lucky enough to be in a movie with amazing special effects. TejonDB takes SQL Server to Hollywood and turns it into a node and connection style NoSQL Graph database. In this Lightning Talk you'll see several cool interactive node and connection data visualizations.</p>\r\n<p><br />- Building WPF Applications Using CODE Framework, Geoffrey Callaghan</p>\r\n<p>CODE Framework is a free, .NET based development framework offered by EPS Software. In this session, I will give a brief overview of some of the strong points of the framework, such as:<br />1) CODE Framework uses a hybrid MVC/MVVM approach, which allows web developers to build desktop applications without a steep learning curve. <br />2) Applications built using CODE Framework come with multiple themes built right in. <br />3) CODE Framework includes utilities that make communicating with the service layer simple and easy to implement.</p>",
      "time": "2016-10-28T15:00:00Z",
      "room": "Room 3 (Pikes Peak)",
      "roomId": "2b4d3037c2334fe5b3c99d688c07f31b"
    },
    {
      "id": "418baed0c9b8457f996ca4b48a091fe6",
      "title": "Practical Performance Tips and Tricks to Make Your HTML/JavaScript Faster",
      "speakers": [
        {
          "id": "1d4bd1f622114bbcb29997ef1dd5ff24",
          "fullName": "Doris Chen"
        }
      ],
      "abstract": "<p>How to tackle real-world web platform performance problems in modern websites and apps? This session starts with a basic understanding of the web platform and then explores to a set of problem/solution pairs built from industry-standard performance guidance. In the talk, we will demonstrate performance tips and tricks that will help you improve the performance of your apps and sites today. &nbsp;We will discuss the following respond to network requests, speed and responsiveness, optimizing media usage, and writing fast JavaScript. These performance tips and tricks apply equally to web sites that run on standards based web browsers, as well as to modern apps.</p>\r\n<p>&nbsp;</p>",
      "time": "2016-10-28T16:15:00Z",
      "room": "Room 1 & 2 (Maroon Bells 1 & 2)",
      "roomId": "628f7d2ad64841d88d8f4f33daf9d3b7"
    },
    {
      "id": "160b3980047d47c5bafbd19247f02b2f",
      "title": "Introduction to the Microsoft Bot Framework",
      "speakers": [
        {
          "id": "281bc0aede4d4477b0fd7f467fac45ed",
          "fullName": "Joe  Mayo"
        }
      ],
      "abstract": "<p>Developers, like you, are increasingly adding conversational user interfaces (CUI) to their applications and tools for enabling this are getting better. One of these new tools is the Microsoft Bot Framework. Learn how these tools can help you add more intelligent interaction directly into your applications. You'll learn how to write your own bot to communicate with a user as well as managing conversation state. Along the way, you'll see how to debug bot apps and use other Bot Framework tools. Finally, you'll learn how to publish and register your bot. After this presentation, you'll have enough information to get started coding your own bot.</p>",
      "time": "2016-10-28T16:15:00Z",
      "room": "Room 4 (Pyramid Peak)",
      "roomId": "7e4b17cd6758411ca826f3fc15207c84"
    },
    {
      "id": "88e4b81312fe43529fe27871e3e56f39",
      "title": "Lightning Talks 2 - Community, Azure, Data Sources ",
      "speakers": [
        {
          "id": "eccc7f3ede15424cbdf89877abe98286",
          "fullName": "Dave Rael"
        },
        {
          "id": "cf70d98c001d4deaaea4c0af61eba261",
          "fullName": "James  Sturtevant"
        },
        {
          "id": "153df63b4b624959b490c1bde2530451",
          "fullName": "David  Yack"
        }
      ],
      "abstract": "<p>- Getting Involved, Dave Kenneth Rael</p>\r\n<p>Find out about why you want to be more involved in your developer community and ways you can go about doing it.&nbsp; The benefits of engagement are numerous and you are better at dealing with humans than you think.&nbsp; Become a more social coder and raise your profile.</p>\r\n<p><br />- Introduction to Service Fabric, James Sturtevant</p>\r\n<p>Orchestration, automation, and monitoring are just some of the challenges when moving to container technology. Service Fabric is a distributed services platform that solves these challenges and more. It is a battle tested system that is used inside Microsoft for its mission critical applications such as Azure SQL, Document DB, and Bing Cortana - processing more than 500 million evaluations per second. In this session we will explore Service Fabric and see how it helps to solve the challenges of distributed computing.</p>\r\n<p><br />- PowerApps, Flow and the Common Data Model, David Yack</p>\r\n<p>In this lightening talk we will look at how to build apps and automation that connects to existing data sources like SharePoint, Office 365, Dynamics 365, Common Data Model and even a Custom APIs.</p>",
      "time": "2016-10-28T16:15:00Z",
      "room": "Room 3 (Pikes Peak)",
      "roomId": "2b4d3037c2334fe5b3c99d688c07f31b"
    },
    {
      "id": "617d165e703243c5bd7ff87246180d36",
      "title": "An Introduction to Domain Driven Design",
      "speakers": [
        {
          "id": "eccc7f3ede15424cbdf89877abe98286",
          "fullName": "Dave Rael"
        }
      ],
      "abstract": "<p>The most important part of building a system right is building the right system. Understanding the nature of the problem and diving deep into the domain for which the system is constructed is a prerequisite for quality construction. This will be a journey into a sample domain based on real-world experience. Walk through a decomposition of the domain into subdomains around which teams can be organized to create a solution. There will not be a lot of code in this one, just enough to create a skeleton on which a system can be built aligning with the goals of the organization.</p>",
      "time": "2016-10-28T17:30:00Z",
      "room": "Room 3 (Pikes Peak)",
      "roomId": "2b4d3037c2334fe5b3c99d688c07f31b"
    },
    {
      "id": "6a96a2e7e34943ae97346d928aa22a19",
      "title": "Professional Ethics for Software Developers",
      "speakers": [
        {
          "id": "afd2610e0b6841a089e0e3a516a3b265",
          "fullName": "Martin  Buchanan"
        }
      ],
      "abstract": "<p>Professional Ethics for Software Developers</p>\r\n<p>Martin L. Buchanan will present case studies, review the ethical obligations of software developers, and discuss any cases raised by the audience. Cases may include:</p>\r\n<p>The Case of the Phony Professor<br />The Cases of Unneeded Custom Software<br />The Case of the Inept Whistleblower<br />The Case of the Disappearing Engineers<br />The Case of Uncle Sam, Software Thief</p>\r\n<p>Copies of the ACM/IEEE Computer Society Software Engineering Code of Ethics and Professional Practice will be provided (see <a href=\"http://www.acm.org/about/se-code\">http://www.acm.org/about/se-code</a>).</p>\r\n<p>Bring your ethics-related concerns, experiences, and questions.</p>",
      "time": "2016-10-28T17:30:00Z",
      "room": "Room 4 (Pyramid Peak)",
      "roomId": "7e4b17cd6758411ca826f3fc15207c84"
    },
    {
      "id": "076684bfd8b64dacbc84e7b59a0d7be0",
      "title": "Entity Framework Core: The Basics",
      "speakers": [
        {
          "id": "fa86041399a74f9eaae6c8af2699c674",
          "fullName": "Parker  Smart"
        }
      ],
      "abstract": "<p>Set up a project using EF Core and Code First and do the basic CRUD operations. &nbsp;Nothing fancy, but highlight the differences with the old EF and some pitfalls.</p>",
      "time": "2016-10-28T17:30:00Z",
      "room": "Room 1 & 2 (Maroon Bells 1 & 2)",
      "roomId": "628f7d2ad64841d88d8f4f33daf9d3b7"
    },
    {
      "id": "d3c7d365c80e44a0ab47d5d4097dc546",
      "title": "VR and the Future",
      "speakers": [
        {
          "id": "44a69af8b518474ea91f55fae4026e3f",
          "fullName": "Chris Fornof"
        }
      ],
      "abstract": "<p>It's an exciting time in virtual reality! While gaming and entertainment show much promise for the industry, in this session find out why enterprise applications are the future. Along the way, we'll explore a few scenarios on how platform toolchain iPaas integration development could be impacted by these powerful new UX ecosystems. Join us for a glimpse of VR and the future!</p>",
      "time": "2016-10-28T19:15:00Z",
      "room": "Room 1 (Maroon Bells 1)",
      "roomId": "22cbffdfb6714f84850af38719685a40"
    },
    {
      "id": "c1463f9d8398440593fd7c69a2f7b2fa",
      "title": "Building Resilient Mobile Applications",
      "speakers": [
        {
          "id": "cf70d98c001d4deaaea4c0af61eba261",
          "fullName": "James  Sturtevant"
        }
      ],
      "abstract": "<p>Most applications require a backend service to do the complex processing.  In this session, we will see how to build resilient communication with a backend service in the mobile world where we are not always connected to our service.  Using a Xamarin application, We will focus on techniques like request prioritization, caching and more.  By the end of the of the talk, you will be familiar with several techniques to ensure your app performs well in all situations and learn about a few libraries that enable resiliency in your applications.</p>",
      "time": "2016-10-28T19:15:00Z",
      "room": "Room 4 (Pyramid Peak)",
      "roomId": "7e4b17cd6758411ca826f3fc15207c84"
    },
    {
      "id": "9fbf8c621d3949288e6ab8715bf941d1",
      "title": "Behavior Driven Development in .Net",
      "speakers": [
        {
          "id": "de1a0dced6ee43549c13e27c7076f026",
          "fullName": "Will  Robertson"
        }
      ],
      "abstract": "<p>As systems become more complex, both testing and the ability to meaningful describe the intention of a system can become quite difficult. All the stakeholders within a system need to have a common lexicon to which new ideas and existing concepts are proliferated in a standard fashion, creating a single version of the truth where it is harder for interpretation to drive development.<br />Behavioral Driven Development attempts to solve this, by creating a framework in which all stakeholders are able to concisely describe functional pieces of a system. This talk will cover outline of Behavior Driven Development in .Net using open source tools such as SpecFlow and NSpec, how to take advantage of some of these tools, how to work with other testing frameworks and experiences of what can go right and what can go wrong.</p>",
      "time": "2016-10-28T19:15:00Z",
      "room": "Room 3 (Pikes Peak)",
      "roomId": "2b4d3037c2334fe5b3c99d688c07f31b"
    },
    {
      "id": "a104b91f087d4bc7afcb99dac4d8c5a1",
      "title": "An introduction to the Universal Windows Platform and the UWP Community Toolkit",
      "speakers": [
        {
          "id": "5cffcf3634bb471e8d47f5eaf8d37040",
          "fullName": "Shawn  Kendrot"
        }
      ],
      "abstract": "<p>Familiar with XAML? Have you been doing WPF development for the past 10 years and ready for something new? In this session we'll introduce you to the new Universal Windows Platform. Learn how to make apps for Desktop (yes, actual desktop apps!), mobile, XBox, and IoT. Oh yeah, you can also develop apps for something called the HoloLens. This will be a fast paced session, so get ready.</p>",
      "time": "2016-10-28T19:15:00Z",
      "room": "Room 2 (Maroon Bells 2)",
      "roomId": "2c8961fee6a34769b80bd043cfd3537e"
    },
    {
      "id": "919e7d3d4e7b418ab301919cd3cab9f2",
      "title": "Delighting Users with Microsoft's Cognitive Services APIs",
      "speakers": [
        {
          "id": "5c55bdbac40c4223b2c020313cdd081b",
          "fullName": "Jerry Nixon"
        }
      ],
      "abstract": "<p>Machine Learning technology is all the buzz these days, but it is difficult to understand and even more difficult to use effectively in your applications. &nbsp;In this session we'll take a look at Microsoft Cognitive Services API and how we can easily leverage these powerful APIs to transform our everyday software applications, dramatically improve our user experience, and delight our users!</p>",
      "time": "2016-10-28T20:30:00Z",
      "room": "Room 2 (Maroon Bells 2)",
      "roomId": "2c8961fee6a34769b80bd043cfd3537e"
    },
    {
      "id": "eecfce44884d4ba29f3d23d7a4dd1f28",
      "title": "Production Quality SQL Server Design and Development",
      "speakers": [
        {
          "id": "d2823eed5bd240b086c75b74bd4407f0",
          "fullName": "Paul  Nielsen"
        }
      ],
      "abstract": "<p>Most SQL Server presentations demo a new feature and explain a specific technique, that that&rsquo;s great, but how do you pull it all together and make sure you&rsquo;re developing a SQL database that will perform well in production? This session focuses on the most important key schema design and T-SQL code techniques that will help you develop a more robust database that will scale well while maintaining high data integrity.</p>",
      "time": "2016-10-28T20:30:00Z",
      "room": "Room 3 (Pikes Peak)",
      "roomId": "2b4d3037c2334fe5b3c99d688c07f31b"
    },
    {
      "id": "b067b4620cb74303864aacd6d5767b84",
      "title": "Web development with F#",
      "speakers": [
        {
          "id": "97b6a4eb6af64fcd8c6b7d08b84ba475",
          "fullName": "Grigoriy  Belenkiy"
        }
      ],
      "abstract": "<p>Think of F# as a general purpose language. Yes, you could do cool web stuff with it!</p>",
      "time": "2016-10-28T20:30:00Z",
      "room": "Room 4 (Pyramid Peak)",
      "roomId": "7e4b17cd6758411ca826f3fc15207c84"
    },
    {
      "id": "671845cae50b4a77b83bcaff78ae5ab4",
      "title": "Design Patterns and Infrastructure Using ASP.NET Core",
      "speakers": [
        {
          "id": "26e95e4037dc4161b3739fa3df2ce415",
          "fullName": "Donald  Lutz"
        }
      ],
      "abstract": "<p>How to use design patterns such as bulkhead and circuit breaker as well health monitoring with consul and middleware using ASP.NET Core microservices.</p>",
      "time": "2016-10-28T20:30:00Z",
      "room": "Room 1 (Maroon Bells 1)",
      "roomId": "22cbffdfb6714f84850af38719685a40"
    },
    {
      "id": "c577e231913a42b2af636142e7a64caa",
      "title": "Add Scripting to Your Tried and True Program",
      "speakers": [
        {
          "id": "713c454f81c34cd4b2b487c2f2254ade",
          "fullName": "Rob Koch"
        }
      ],
      "abstract": "<p>I will give a quick overview of an existing WinForms app that may been around for 15 years and one day your boss tells you to add a feature to it. This will describe a way to use IronPython to add features to it without needing a serious refactor.</p>",
      "time": "2016-10-28T21:45:00Z",
      "room": "Room 3 (Pikes Peak)",
      "roomId": "2b4d3037c2334fe5b3c99d688c07f31b"
    },
    {
      "id": "267c62912787412aa962b7bc0916aa0b",
      "title": "Understanding Dependency Injection with ASP.NET Core",
      "speakers": [
        {
          "id": "51d198ad5a3e488bb77abee724854257",
          "fullName": "Laurie  Atkinson"
        }
      ],
      "abstract": "<p>Dependency Injection (DI) is a technique used to reduce tight-coupling within your application and build testable code. DI is baked into ASP.NET Core and a basic understanding is required if you plan to move forward with ASP.NET, so now&rsquo;s the time to embrace it. We&rsquo;ll walk through what DI is and then we&rsquo;ll step into the code of an ASP.NET Core application to see where it fits into this new framework.</p>",
      "time": "2016-10-28T21:45:00Z",
      "room": "Room 1 (Maroon Bells 1)",
      "roomId": "22cbffdfb6714f84850af38719685a40"
    },
    {
      "id": "6f0273c204d64522a258608de89f4187",
      "title": "TypeScript: The Future of Front End Web Development",
      "speakers": [
        {
          "id": "ee5aae31bd834d5aa9264f3dece7acdc",
          "fullName": "Ben Hoelting"
        }
      ],
      "abstract": "<p>TypeScript is the real deal.&nbsp; Many developers have heard of TypeScript but most have never used it in production. Many C# developers hate JavaScript.&nbsp; I believe the reason for their hatred has nothing to do with JavaScript but with the lack of tooling and language features.&nbsp; TypeScript is a language developed by the creators of C# that compiles to JavaScript.&nbsp; This session will dive into TypeScript and discuss some of the language features it provides on top of normal JavaScript.&nbsp; Between the IDE enhancements in VS and the language features of TypeScript, you will see that JavaScript development can be fun! You will learn: A definition of TypeScript, New TypeScript Features in VS, How to use VS and TypeScript to make production quality applications.</p>",
      "time": "2016-10-28T21:45:00Z",
      "room": "Room 4 (Pyramid Peak)",
      "roomId": "7e4b17cd6758411ca826f3fc15207c84"
    },
    {
      "id": "6f181aa458f1464c9eebc79e47c53ede",
      "title": "UWP and Windows Composition",
      "speakers": [
        {
          "id": "1c43c2ce21154271a576c2a9be70c9b1",
          "fullName": "Daren May"
        }
      ],
      "abstract": "<p><span>Take your UWP app experience to the next level by using Windows Composition to deliver amazing animations and effects. Daren will introduce the foundational concepts and show some features you can easily drop into your apps.</span></p>",
      "time": "2016-10-28T21:45:00Z",
      "room": "Room 2 (Maroon Bells 2)",
      "roomId": "2c8961fee6a34769b80bd043cfd3537e"
    }
  ],
  "rooms": [
    {
      "id": "628f7d2ad64841d88d8f4f33daf9d3b7",
      "tags": [ ],
      "groups": [ ],
      "title": "Room 1 & 2 (Maroon Bells 1 & 2)",
      "capacity": 100,
      "latitude": "34.4253044128418",
      "longitude": "-118.59698486328125",
      "sessions": [ ],
      "sponsors": [ ],
      "links": [
        {
          "rel": "self",
          "href": "https://api.eventday.com/v1/8cd883fd798d407aa4f7fffb78fe4c90/rooms/628f7d2ad64841d88d8f4f33daf9d3b7"
        },
        {
          "rel": "urn:eventday:event",
          "href": "https://api.eventday.com/v1/8cd883fd798d407aa4f7fffb78fe4c90"
        }
      ]
    },
    {
      "id": "22cbffdfb6714f84850af38719685a40",
      "tags": [ ],
      "groups": [ ],
      "title": "Room 1 (Maroon Bells 1)",
      "capacity": 60,
      "latitude": "34.4253044128418",
      "longitude": "-118.59698486328125",
      "sessions": [ ],
      "sponsors": [ ],
      "links": [
        {
          "rel": "self",
          "href": "https://api.eventday.com/v1/8cd883fd798d407aa4f7fffb78fe4c90/rooms/22cbffdfb6714f84850af38719685a40"
        },
        {
          "rel": "urn:eventday:event",
          "href": "https://api.eventday.com/v1/8cd883fd798d407aa4f7fffb78fe4c90"
        }
      ]
    },
    {
      "id": "2c8961fee6a34769b80bd043cfd3537e",
      "tags": [ ],
      "groups": [ ],
      "title": "Room 2 (Maroon Bells 2)",
      "capacity": 40,
      "latitude": "34.4253044128418",
      "longitude": "-118.59698486328125",
      "sessions": [ ],
      "sponsors": [ ],
      "links": [
        {
          "rel": "self",
          "href": "https://api.eventday.com/v1/8cd883fd798d407aa4f7fffb78fe4c90/rooms/2c8961fee6a34769b80bd043cfd3537e"
        },
        {
          "rel": "urn:eventday:event",
          "href": "https://api.eventday.com/v1/8cd883fd798d407aa4f7fffb78fe4c90"
        }
      ]
    },
    {
      "id": "2b4d3037c2334fe5b3c99d688c07f31b",
      "tags": [ ],
      "groups": [ ],
      "title": "Room 3 (Pikes Peak)",
      "capacity": 30,
      "latitude": "34.4253044128418",
      "longitude": "-118.59698486328125",
      "sessions": [ ],
      "sponsors": [ ],
      "links": [
        {
          "rel": "self",
          "href": "https://api.eventday.com/v1/8cd883fd798d407aa4f7fffb78fe4c90/rooms/2b4d3037c2334fe5b3c99d688c07f31b"
        },
        {
          "rel": "urn:eventday:event",
          "href": "https://api.eventday.com/v1/8cd883fd798d407aa4f7fffb78fe4c90"
        }
      ]
    },
    {
      "id": "7e4b17cd6758411ca826f3fc15207c84",
      "tags": [ ],
      "groups": [ ],
      "title": "Room 4 (Pyramid Peak)",
      "capacity": 20,
      "latitude": "34.4253044128418",
      "longitude": "-118.59698486328125",
      "sessions": [ ],
      "sponsors": [ ],
      "links": [
        {
          "rel": "self",
          "href": "https://api.eventday.com/v1/8cd883fd798d407aa4f7fffb78fe4c90/rooms/7e4b17cd6758411ca826f3fc15207c84"
        },
        {
          "rel": "urn:eventday:event",
          "href": "https://api.eventday.com/v1/8cd883fd798d407aa4f7fffb78fe4c90"
        }
      ]
    },
    {
      "id": "cc0a8d169c9a4d62b7ae31a24e8cc3cc",
      "tags": [ ],
      "groups": [ ],
      "title": "Room 5 (Longs Peak)",
      "capacity": 15,
      "latitude": "34.4253044128418",
      "longitude": "-118.59698486328125",
      "sessions": [ ],
      "sponsors": [ ],
      "links": [
        {
          "rel": "self",
          "href": "https://api.eventday.com/v1/8cd883fd798d407aa4f7fffb78fe4c90/rooms/cc0a8d169c9a4d62b7ae31a24e8cc3cc"
        },
        {
          "rel": "urn:eventday:event",
          "href": "https://api.eventday.com/v1/8cd883fd798d407aa4f7fffb78fe4c90"
        }
      ]
    }
  ],
  "sponsors": [
    {
      "id": "3bafe344c1284ccfa1d2f1a04ffa561e",
      "name": "Microsoft",
      "link": "http://microsoft.com/",
      "logo": "https://az118040.vo.msecnd.net/assets/38a86ae202564fb0b845ca4a0c4cd2d1/sponsor/8e7608b8f38542c6acde1511c8c38c77/MSFT_logo_rgb_C-Gray.png",
      "description": "<p>Microsoft is the world's leading producer and marketer of computer software.</p>\r\n<p><span style=\"color: #68217a; font-family: Arial; font-size: small;\">\"mobile first, cloud first\" - </span> <em><span style=\"color: #68217a; font-family: Arial; font-size: small;\">\"any developer, any app, any platform\"</span></em></p>\r\n<p>Microsoft Corporation is an American multinational corporation headquartered in Redmond, Washington, that develops, manufactures, licenses, supports and sells computer software, consumer electronics and personal computers and services. Its best known software products are the Microsoft Windows line of operating systems, Microsoft Office office suite, and Internet Explorer web browser. Its flagship hardware products are Xbox game console and the Microsoft Surface series of tablets. It is the world's largest software maker measured by revenues. It is also one of the world's most valuable companies.</p>\r\n<p>&nbsp;</p>"
    },
    {
      "id": "fffa72620b804ab7abf8c4f3597c0e0f",
      "name": "RevGen Partners",
      "link": "http://www.revgenpartners.com/",
      "logo": "https://az118040.vo.msecnd.net/assets/8cd883fd798d407aa4f7fffb78fe4c90/sponsor/fffa72620b804ab7abf8c4f3597c0e0f/revgen-logo.jpg",
      "description": "<p><a href=\"http://www.revgenpartners.com/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?hl=en&amp;q=http://www.revgenpartners.com/&amp;source=gmail&amp;ust=1465950632534000&amp;usg=AFQjCNE1wEe-XNuuC3e01-K38VI-yubAhA\">RevGen Partners</a>&nbsp;is a business consulting firm specializing in digital innovation, analytics &amp; data management and business transformation. We are based in the Denver Tech Center with just under 100 employees.</p>\r\n<p>We solve our clients&rsquo; business problems with digital and data solutions including custom web and mobile applications. Our development work is in the Microsoft stack and beyond: C#, .NET, MVC, Angular, Bootstrap, JavaScript, Xamarin, PhoneGap, and more. We approach all of our consulting engagements as a business partner and consistently deliver value with speed and agility. &nbsp;RevGen Partners is a people-focused business driven by core values of integrity, respect, stewardship, and enjoyment. The firm has been recognized as a top place to work by The Denver Post for the past three years.</p>"
    },
    {
      "id": "bce0a7b009be421eb3b576ab9c8e442d",
      "name": "TEKsystems",
      "link": "http://www.teksystems.com/",
      "logo": "https://az118040.vo.msecnd.net/assets/38a86ae202564fb0b845ca4a0c4cd2d1/sponsor/591788dda7f14a9cad458dcf4c1692bb/TEKsystems(R)_tagline(R)_RGB.png",
      "description": "<p><strong>About TEKsystems</strong></p>\r\n<p>Businesses are challenged to stay ahead of the latest trends and competitive developments while building a responsive and agile IT capability to support growth. However, since everyone has access to the same tools, technology alone does not offer a competitive advantage. Your advantage depends on how you apply technology&mdash;more specifically, on the people who lead, support and optimize your IT initiatives.</p>\r\n<p><strong>IT Solutions that Work</strong></p>\r\n<p>The success of any initiative hinges on the quality of the people driving it.</p>\r\n<div class=\"sub-text\">\r\n<p>Our <a href=\"http://www.teksystems.com/services/it-talent-management-expertise\">IT talent management expertise</a> ensures you attract, develop and retain the best IT professionals required to achieve your business targets better, faster and more cost-effectively. We have the largest global network of credentialed IT professionals to lead and support your engagements. With <a href=\"http://www.teksystems.com/locations\">over 100 locations</a>, 5,000 employees throughout North America, Europe and Asia and an IT consultant network that encompasses over 81 percent of the IT workforce, we deploy more than 80,000 technical professionals annually to support critical engagements at more than 6,000 client sites, including 82 percent of the Fortune 500. In every <a href=\"http://www.teksystems.com/services/it-talent-management-expertise/local-market-expertise\">local market</a>, we build upon our pipelines of talented IT professionals, employing IT talent management best practices and ensuring our Employee Value Propositions (EVPs) stay competitive and compelling.</p>\r\n</div>"
    }
  ]
}